### **Network Topology Setup for Secure Corporate Network Design**

### **Devices and Their Configuration**

#### **1. Devices Required:**
- **Routers:** 1 (Router0)
- **Switches:** 3 (One for each department: HR-Switch, IT-Switch, Sales-Switch)
- **PCs:** 6 (Two in each department: HR-PC1, HR-PC2, IT-PC1, IT-PC2, Sales-PC1, Sales-PC2)

### **2. Choosing the Switch Type**
- **Switch Type:** Use a Cisco 2960 Switch for each department. This switch supports VLAN configuration, port security, and 
other essential features for this project.

### **3. Network Topology Overview:**
- **HR Department:** HR-Switch connected to HR-PC1 and HR-PC2.
- **IT Department:** IT-Switch connected to IT-PC1 and IT-PC2.
- **Sales Department:** Sales-Switch connected to Sales-PC1 and Sales-PC2.
- **Router0:** Connected to all three switches for inter-VLAN routing.

### **Step-by-Step Command Guide**

#### **Step 1: Configure VLANs on Each Switch**

- **Access the Switch CLI:**
  - Click on the switch (e.g., HR-Switch), go to the CLI tab.

- **Create VLANs:**
  - **HR VLAN:**
    ```bash
    Switch>enable
    Switch#configure terminal
    Switch(config)#vlan 10
    Switch(config-vlan)#name HR
    Switch(config-vlan)#exit
    ```
  - **IT VLAN:**
    ```bash
    Switch(config)#vlan 20
    Switch(config-vlan)#name IT
    Switch(config-vlan)#exit
    ```
  - **Sales VLAN:**
    ```bash
    Switch(config)#vlan 30
    Switch(config-vlan)#name Sales
    Switch(config-vlan)#exit
    ```

- **Assign Ports to VLANs:**
  - For HR-Switch:
    ```bash
    Switch(config)#interface range FastEthernet0/1-2
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 10
    Switch(config-if-range)#exit
    ```
  - For IT-Switch:
    ```bash
    Switch(config)#interface range FastEthernet0/1-2
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 20
    Switch(config-if-range)#exit
    ```
  - For Sales-Switch:
    ```bash
    Switch(config)#interface range FastEthernet0/1-2
    Switch(config-if-range)#switchport mode access
    Switch(config-if-range)#switchport access vlan 30
    Switch(config-if-range)#exit
    ```

#### **Step 2: Configure Inter-VLAN Routing on Router0**

- **Access the Router CLI:**
  - Click on the router (Router0), go to the CLI tab.

- **Configure Sub-Interfaces for VLANs:**
  - For HR VLAN:
    ```bash
    Router>enable
    Router#configure terminal
    Router(config)#interface GigabitEthernet0/0.10
    Router(config-subif)#encapsulation dot1Q 10
    Router(config-subif)#ip address 192.168.10.1 255.255.255.0
    Router(config-subif)#exit
    ```
  - For IT VLAN:
    ```bash
    Router(config)#interface GigabitEthernet0/0.20
    Router(config-subif)#encapsulation dot1Q 20
    Router(config-subif)#ip address 192.168.20.1 255.255.255.0
    Router(config-subif)#exit
    ```
  - For Sales VLAN:
    ```bash
    Router(config)#interface GigabitEthernet0/0.30
    Router(config-subif)#encapsulation dot1Q 30
    Router(config-subif)#ip address 192.168.30.1 255.255.255.0
    Router(config-subif)#exit
    ```

- **Enable Routing:**
  ```bash
  Router(config)#ip routing
  Router(config)#exit
  ```

#### **Step 3: Configure ACLs on Router0**

- **Create ACLs for each VLAN:**
  - Example for HR VLAN:
    ```bash
    Router(config)#access-list 101 permit ip 192.168.10.0 0.0.0.255 any
    Router(config)#interface GigabitEthernet0/0.10
    Router(config-if)#ip access-group 101 in
    Router(config-if)#exit
    ```

  - Repeat similar commands for IT and Sales VLANs with corresponding IP ranges.

#### **Step 4: Configure Port Security on Switches**

- **Enable Port Security on HR-Switch:**
  ```bash
  Switch(config)#interface range FastEthernet0/1-2
  Switch(config-if-range)#switchport port-security
  Switch(config-if-range)#switchport port-security maximum 2
  Switch(config-if-range)#switchport port-security violation shutdown
  Switch(config-if-range)#exit
  ```

- **Repeat similar commands for IT-Switch and Sales-Switch.**

#### **Step 5: Configure VPN on Router0**

- **Create an ISAKMP Policy:**
  ```bash
  Router(config)#crypto isakmp policy 10
  Router(config-isakmp)#encryption aes
  Router(config-isakmp)#hash sha
  Router(config-isakmp)#authentication pre-share
  Router(config-isakmp)#group 2
  Router(config-isakmp)#lifetime 86400
  Router(config-isakmp)#exit
  ```

- **Configure IPsec Transform Set:**
  ```bash
  Router(config)#crypto ipsec transform-set MYSET esp-aes esp-sha-hmac
  Router(config)#exit
  ```

- **Create Crypto Map:**
  ```bash
  Router(config)#crypto map MYMAP 10 ipsec-isakmp
  Router(config-crypto-map)#set peer <Remote-Router-IP>
  Router(config-crypto-map)#set transform-set MYSET
  Router(config-crypto-map)#match address 101
  Router(config-crypto-map)#exit
  ```

- **Apply Crypto Map to an Interface:**
  ```bash
  Router(config)#interface GigabitEthernet0/0
  Router(config-if)#crypto map MYMAP
  Router(config-if)#exit
  ```

#### **Step 6: Testing and Verification**

- **Ping Tests:**
  - Test connectivity between VLANs using ping commands from PCs.
  - Test the ACLs by attempting to ping between VLANs with restricted access.
  - Test port security by trying to connect unauthorized devices to the switch.
  - Test the VPN by simulating remote access to the internal network.

- **Use Packet Tracer’s Simulation Mode:**
  - Verify the flow of packets and check if the security measures are properly implemented.

### **Documentation Tips**

- **Network Diagram:**
  - Include a detailed diagram showing how devices are connected, labeled with IP addresses and VLAN IDs.

- **Configuration Files:**
  - Export the running configuration from each device (`show running-config` in the CLI) and save them in text files.
  - Include these in your project documentation.

- **Project Report:**
  - Detail each step of the configuration, with screenshots of the commands being executed.
  - Provide explanations of why each security measure was implemented and how it improves network security.
  - Include a summary of testing results, demonstrating that all security features work as intended.

- **README.md for GitHub:**
  - Provide an overview of the project, including objectives, steps taken, and the final network design.
  - Include instructions on how to open and test the Packet Tracer file.

By following these steps and commands, you'll be able to build a secure corporate network in Cisco Packet Tracer, 
thoroughly test it, and document the project for showcasing in your GitHub repository and CV.

### **Performing Security Attacks on the Network Using Cisco Packet Tracer**

Testing your network's security by simulating different types of attacks can help you identify and mitigate vulnerabilities. 
Below are some common network security attacks you can perform using Cisco Packet Tracer, along with instructions on how to execute them.

---

### **1. MAC Flooding Attack**
**Objective:** Overwhelm a switch’s MAC address table, causing it to flood traffic to all ports, which can lead to network congestion 
and potential data interception.

#### **Steps:**
1. **Prepare the Network:**
   - Ensure your switches have MAC address tables that can be flooded.
   
2. **Simulate the Attack:**
   - In Packet Tracer, use multiple PCs to rapidly generate different MAC addresses.
   - Go to the CLI of the attacking PC and manually set different MAC addresses:
     ```bash
     PC> ipconfig /all
     PC> mac address <new_mac_address>
     PC> ping <target_ip_address>
     ```
   - Repeat the process to generate many MAC addresses until the switch's table is full.

3. **Monitor the Effect:**
   - Observe the switch’s MAC address table using `show mac address-table` to see if it starts flooding packets to all ports.

4. **Mitigation:**
   - **Port Security:** On the switch, configure port security to limit the number of MAC addresses per port, as previously set up in the project.

### **2. ARP Spoofing/Poisoning Attack**
**Objective:** Redirect traffic between devices by sending fake ARP (Address Resolution Protocol) messages to associate your MAC address with the 
IP address of another device.

#### **Steps:**
1. **Prepare the Network:**
   - Identify the target devices on the network (e.g., HR-PC1 and Router).

2. **Simulate the Attack:**
   - On the attacking PC, use the ARP command to associate the router's IP address with the attacker's MAC address:
     ```bash
     PC> arp -s <target_ip_address> <attacker_mac_address>
     ```
   - Send the ARP message repeatedly to poison the ARP cache of the target.

3. **Monitor the Effect:**
   - Use `arp -a` on the target PC to check if the ARP cache has been poisoned.
   - If successful, the target PC will send packets meant for the router to the attacker.

4. **Mitigation:**
   - **Dynamic ARP Inspection (DAI):** Enable DAI on the switch to prevent ARP spoofing by validating ARP packets against DHCP snooping binding tables.

### **3. DHCP Starvation Attack**
**Objective:** Exhaust the DHCP server's IP address pool by sending a large number of DHCP requests, causing it to deny legitimate devices IP addresses.

#### **Steps:**
1. **Prepare the Network:**
   - Ensure a DHCP server is configured on the network to provide IP addresses to clients.

2. **Simulate the Attack:**
   - On the attacking PC, repeatedly send DHCP requests using a script or manually by releasing and renewing the IP configuration:
     ```bash
     PC> ipconfig /release
     PC> ipconfig /renew
     ```
   - Alternatively, configure multiple PCs to request IP addresses simultaneously.

3. **Monitor the Effect:**
   - Check the DHCP server's address pool to see if it is exhausted, preventing new devices from obtaining an IP address.

4. **Mitigation:**
   - **Port Security:** Configure port security to limit the number of DHCP requests per port.
   - **DHCP Snooping:** Enable DHCP snooping on the switch to prevent unauthorized DHCP servers from responding to requests.

### **4. Man-in-the-Middle (MitM) Attack**
**Objective:** Intercept and alter communication between two devices by placing yourself between them on the network.

#### **Steps:**
1. **Prepare the Network:**
   - Identify two devices (e.g., HR-PC1 and Router) whose communication you want to intercept.

2. **Simulate the Attack:**
   - Perform ARP spoofing to associate your MAC address with the IP address of both target devices, as described in the ARP Spoofing section.
   - Once you’ve positioned yourself in the middle, capture the traffic using Packet Tracer’s simulation mode to view the packets being transmitted.

3. **Monitor the Effect:**
   - Analyze the captured traffic to see if you can read or alter the information being sent between the two devices.

4. **Mitigation:**
   - **Encryption:** Ensure that sensitive data is encrypted (e.g., using HTTPS, SSL/TLS) to prevent reading or modifying the data, even if it’s intercepted.
   - **Enable IPSec:** Configure IPSec to encrypt traffic across the network, especially for critical communications.

### **5. VLAN Hopping Attack**
**Objective:** Send packets from one VLAN to another, bypassing the VLAN segmentation.

#### **Steps:**
1. **Prepare the Network:**
   - Ensure that VLANs are properly configured on the network switches.

2. **Simulate the Attack:**
   - Attempt to double-tag VLAN hopping by sending frames with two VLAN tags. In Packet Tracer, you may need to simulate this by manually editing packets 
in the simulation mode.
   - Example: Send a packet with VLAN 10 (HR) as the outer tag and VLAN 20 (IT) as the inner tag.

3. **Monitor the Effect:**
   - If successful, the packet may be forwarded to the target VLAN, bypassing the VLAN restrictions.

4. **Mitigation:**
   - **Disable Unused Ports:** Disable unused ports or place them in an unused VLAN.
   - **Avoid Using VLAN 1:** Avoid using VLAN 1 for any purpose other than the native VLAN.
   - **Implement VTP (VLAN Trunking Protocol):** Ensure that VTP is properly configured to prevent unauthorized VLAN changes.

### **6. DoS Attack (Denial of Service)**
**Objective:** Overload a network device, making it unavailable to legitimate users by sending a large volume of traffic.

#### **Steps:**
1. **Prepare the Network:**
   - Identify a target device or service (e.g., a web server or router).

2. **Simulate the Attack:**
   - On multiple PCs, simultaneously send a large number of ping requests to the target device:
     ```bash
     PC> ping <target_ip_address> -t
     ```
   - Increase the packet size to further stress the network.

3. **Monitor the Effect:**
   - Observe the target device's performance. It should become unresponsive or slow down significantly.

4. **Mitigation:**
   - **Rate Limiting:** Configure rate limiting on switches and routers to prevent a single device from consuming too much bandwidth.
   - **Enable Firewalls:** Use firewalls to filter and block malicious traffic patterns.

---

### **Conclusion**
By performing these attacks, you can evaluate the robustness of your network's security. After each attack, document your findings, including how the 
network behaved and how effective the security measures were in mitigating the attack. This documentation will be valuable for improving the network design 
and for showcasing your skills in your project report.